RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F10x_StdPeriph_Driver/StdPeriph_Driver/inc/ch32f10x_usb.h
/***************COPYRIGHT(C)  2019 WCH. A11 rights reserved*********************
 * File Name          : ch32f10x_usb.h
 * Author             : WCH
 * Version            : V1.0.0
 * Date               : 2019/10/15
 * Description        : This file contains all the functions prototypes for the USB 
 *                      firmware library.
 *******************************************************************************/ 
#ifndef __CH32F10x_USB_H
#define __CH32F10x_USB_H
#include "stdio.h"
#ifdef __cplusplus
extern "C" {
#endif

#ifndef NULL
#define NULL                    0
#endif

#ifndef VOID
#define VOID                    (void)
#endif
#ifndef CONST
#define CONST                   const
#endif
#ifndef BOOL
typedef unsigned char           BOOL;
#endif
#ifndef BOOLEAN
typedef unsigned char           BOOLEAN;
#endif
#ifndef CHAR
typedef char                    CHAR;
#endif
#ifndef INT8
typedef char                    INT8;
#endif
#ifndef INT16
typedef short                   INT16;
#endif
#ifndef INT32
typedef long                    INT32;
#endif
#ifndef UINT8
typedef unsigned char           UINT8;
#endif
#ifndef UINT16
typedef unsigned short          UINT16;
#endif
#ifndef UINT32
typedef unsigned long           UINT32;
#endif
#ifndef UINT8V
typedef unsigned char volatile  UINT8V;
#endif
#ifndef UINT16V
typedef unsigned short volatile UINT16V;
#endif
#ifndef UINT32V
typedef unsigned long volatile  UINT32V;
#endif

#ifndef PVOID
typedef void                    *PVOID;
#endif
#ifndef PCHAR
typedef char                    *PCHAR;
#endif
#ifndef PCHAR
typedef const char              *PCCHAR;
#endif
#ifndef PINT8
typedef char                    *PINT8;
#endif
#ifndef PINT16
typedef short                   *PINT16;
#endif
#ifndef PINT32
typedef long                    *PINT32;
#endif
#ifndef PUINT8
typedef unsigned char           *PUINT8;
#endif
#ifndef PUINT16
typedef unsigned short          *PUINT16;
#endif
#ifndef PUINT32
typedef unsigned long           *PUINT32;
#endif
#ifndef PUINT8V
typedef volatile unsigned char  *PUINT8V;
#endif
#ifndef PUINT16V
typedef volatile unsigned short *PUINT16V;
#endif
#ifndef PUINT32V
typedef volatile unsigned long  *PUINT32V;
#endif

/******************************************************************************/
/*                         Peripheral memory map                              */
/******************************************************************************/
/* usb addresses         
//      USB:     +8000H - 83FFH                                                    */
#define USB_BASE_ADDR              (0x40023400)
#define EXTEN_CTRL                 (*((PUINT32V)(0x40023800)))
#define USBD_LOWSPEED               ((UINT32)0x0001)
#define USBD_PU_EN                  ((UINT32)0x0002)
#define USBHD_IO_EN                 ((UINT32)0x0004)
#define USB_5V_SEL                  ((UINT32)0x0008)
#define RCC_AHBPeriph_USBHD         ((UINT32)0x00001000)
/*       USB  */
#define	R32_USB_CONTROL		(*((PUINT32V)(0x40023400)))	// USB control & interrupt enable & device address
#define	R8_USB_CTRL			(*((PUINT8V)(0x40023400)))	// USB base control
#define 	RB_UC_HOST_MODE     0x80      // enable USB host mode: 0=device mode, 1=host mode
#define 	RB_UC_LOW_SPEED     0x40      // enable USB low speed: 0=12Mbps, 1=1.5Mbps
#define 	RB_UC_DEV_PU_EN     0x20      // USB device enable and internal pullup resistance enable
#define 	RB_UC_SYS_CTRL1     0x20      // USB system control high bit
#define 	RB_UC_SYS_CTRL0     0x10      // USB system control low bit
#define 	MASK_UC_SYS_CTRL  	0x30      // bit mask of USB system control
// bUC_HOST_MODE & bUC_SYS_CTRL1 & bUC_SYS_CTRL0: USB system control
//   0 00: disable USB device and disable internal pullup resistance
//   0 01: enable USB device and disable internal pullup resistance, need external pullup resistance
//   0 1x: enable USB device and enable internal pullup resistance
//   1 00: enable USB host and normal status
//   1 01: enable USB host and force UDP/UDM output SE0 state
//   1 10: enable USB host and force UDP/UDM output J state
//   1 11: enable USB host and force UDP/UDM output resume or K state
#define 	RB_UC_INT_BUSY      0x08      // enable automatic responding busy for device mode or automatic pause for host mode during interrupt flag UIF_TRANSFER valid
#define 	RB_UC_RESET_SIE     0x04      // force reset USB SIE, need software clear
#define 	RB_UC_CLR_ALL       0x02      // force clear FIFO and count of USB
#define 	RB_UC_DMA_EN        0x01      // DMA enable and DMA interrupt enable for USB

#define	R8_UDEV_CTRL		(*((PUINT8V)(0x40023401)))	// USB device physical prot control
#define 	RB_UD_PD_DIS        0x80      // disable USB UDP/UDM pulldown resistance: 0=enable pulldown, 1=disable
#define 	RB_UD_DP_PIN        0x20      // ReadOnly: indicate current UDP pin level
#define 	RB_UD_DM_PIN        0x10      // ReadOnly: indicate current UDM pin level
#define 	RB_UD_LOW_SPEED     0x04      // enable USB physical port low speed: 0=full speed, 1=low speed
#define 	RB_UD_GP_BIT        0x02      // general purpose bit
#define 	RB_UD_PORT_EN       0x01      // enable USB physical port I/O: 0=disable, 1=enable

#define	R8_UHOST_CTRL		R8_UDEV_CTRL				// USB host physical prot control
#define 	RB_UH_PD_DIS        0x80      // disable USB UDP/UDM pulldown resistance: 0=enable pulldown, 1=disable
#define 	RB_UH_DP_PIN        0x20      // ReadOnly: indicate current UDP pin level
#define 	RB_UH_DM_PIN        0x10      // ReadOnly: indicate current UDM pin level
#define 	RB_UH_LOW_SPEED     0x04      // enable USB port low speed: 0=full speed, 1=low speed
#define 	RB_UH_BUS_RESET     0x02      // control USB bus reset: 0=normal, 1=force bus reset
#define 	RB_UH_PORT_EN       0x01      // enable USB port: 0=disable, 1=enable port, automatic disabled if USB device detached

#define	R8_USB_INT_EN		(*((PUINT8V)(0x40023402)))	// USB interrupt enable
#define 	RB_UIE_DEV_SOF      0x80      // enable interrupt for SOF received for USB device mode
#define 	RB_UIE_DEV_NAK      0x40      // enable interrupt for NAK responded for USB device mode
#define 	RB_UIE_FIFO_OV      0x10      // enable interrupt for FIFO overflow
#define 	RB_UIE_HST_SOF      0x08      // enable interrupt for host SOF timer action for USB host mode
#define 	RB_UIE_SUSPEND      0x04      // enable interrupt for USB suspend or resume event
#define 	RB_UIE_TRANSFER     0x02      // enable interrupt for USB transfer completion
#define 	RB_UIE_DETECT       0x01      // enable interrupt for USB device detected event for USB host mode
#define 	RB_UIE_BUS_RST      0x01      // enable interrupt for USB bus reset event for USB device mode

#define	R8_USB_DEV_AD		(*((PUINT8V)(0x40023403)))	// USB device address
#define 	RB_UDA_GP_BIT       0x80      // general purpose bit
#define 	MASK_USB_ADDR      	0x7F      // bit mask for USB device address

#define	R32_USB_STATUS		(*((PUINT32V)(0x40023404)))	// USB miscellaneous status & interrupt flag & interrupt status
#define	R8_USB_MIS_ST		(*((PUINT8V)(0x40023405)))	// USB miscellaneous status
#define 	RB_UMS_SOF_PRES     0x80      // RO, indicate host SOF timer presage status
#define 	RB_UMS_SOF_ACT      0x40      // RO, indicate host SOF timer action status for USB host
#define 	RB_UMS_SIE_FREE     0x20      // RO, indicate USB SIE free status
#define 	RB_UMS_R_FIFO_RDY   0x10      // RO, indicate USB receiving FIFO ready status (not empty)
#define 	RB_UMS_BUS_RESET    0x08      // RO, indicate USB bus reset status
#define 	RB_UMS_SUSPEND      0x04      // RO, indicate USB suspend status
#define 	RB_UMS_DM_LEVEL     0x02      // RO, indicate UDM level saved at device attached to USB host
#define 	RB_UMS_DEV_ATTACH   0x01      // RO, indicate device attached status on USB host

#define	R8_USB_INT_FG		(*((PUINT8V)(0x40023406)))	// USB interrupt flag
#define 	RB_U_IS_NAK		    	0x80	// RO, indicate current USB transfer is NAK received
#define 	RB_U_TOG_OK 	    	0x40	// RO, indicate current USB transfer toggle is OK
#define 	RB_U_SIE_FREE   	  0x20	// RO, indicate USB SIE free status
#define 	RB_UIF_FIFO_OV		  0x10	// FIFO overflow interrupt flag for USB, direct bit address clear or write 1 to clear
#define 	RB_UIF_HST_SOF		  0x08	// host SOF timer interrupt flag for USB host, direct bit address clear or write 1 to clear
#define 	RB_UIF_SUSPEND		  0x04	// USB suspend or resume event interrupt flag, direct bit address clear or write 1 to clear
#define 	RB_UIF_TRANSFER		  0x02	// USB transfer completion interrupt flag, direct bit address clear or write 1 to clear
#define 	RB_UIF_DETECT		    0x01	// device detected event interrupt flag for USB host mode, direct bit address clear or write 1 to clear
#define 	RB_UIF_BUS_RST		  0x01	// bus reset event interrupt flag for USB device mode, direct bit address clear or write 1 to clear

#define	R8_USB_INT_ST		(*((PUINT8V)(0x40023407)))	// USB interrupt status
#define 	RB_UIS_IS_NAK       0x80      // RO, indicate current USB transfer is NAK received for USB device mode
#define 	RB_UIS_TOG_OK       0x40      // RO, indicate current USB transfer toggle is OK
#define 	RB_UIS_TOKEN1       0x20      // RO, current token PID code bit 1 received for USB device mode
#define 	RB_UIS_TOKEN0       0x10      // RO, current token PID code bit 0 received for USB device mode
#define 	MASK_UIS_TOKEN    	0x30      // RO, bit mask of current token PID code received for USB device mode
#define 	UIS_TOKEN_OUT     	0x00
#define 	UIS_TOKEN_SOF     	0x10
#define 	UIS_TOKEN_IN      	0x20
#define 	UIS_TOKEN_SETUP   	0x30
// bUIS_TOKEN1 & bUIS_TOKEN0: current token PID code received for USB device mode
//   00: OUT token PID received
//   01: SOF token PID received
//   10: IN token PID received
//   11: SETUP token PID received
#define 	MASK_UIS_ENDP      	0x0F      // RO, bit mask of current transfer endpoint number for USB device mode
#define 	MASK_UIS_H_RES    	0x0F      // RO, bit mask of current transfer handshake response for USB host mode: 0000=no response, time out from device, others=handshake response PID received

#define	R8_USB_RX_LEN		(*((PUINT8V)(0x40023408)))	// USB receiving length
#define	R32_USB_BUF_MODE	(*((PUINT32V)(0x4002340c)))	// USB endpoint buffer mode
#define	R8_UEP4_1_MOD		(*((PUINT8V)(0x4002340c)))	// endpoint 4/1 mode
#define 	RB_UEP1_RX_EN       0x80      // enable USB endpoint 1 receiving (OUT)
#define 	RB_UEP1_TX_EN       0x40      // enable USB endpoint 1 transmittal (IN)
#define 	RB_UEP1_BUF_MOD     0x10      // buffer mode of USB endpoint 1
// bUEPn_RX_EN & bUEPn_TX_EN & bUEPn_BUF_MOD: USB endpoint 1/2/3 buffer mode, buffer start address is UEPn_DMA
//   0 0 x:  disable endpoint and disable buffer
//   1 0 0:  64 bytes buffer for receiving (OUT endpoint)
//   1 0 1:  dual 64 bytes buffer by toggle bit bUEP_R_TOG selection for receiving (OUT endpoint), total=128bytes
//   0 1 0:  64 bytes buffer for transmittal (IN endpoint)
//   0 1 1:  dual 64 bytes buffer by toggle bit bUEP_T_TOG selection for transmittal (IN endpoint), total=128bytes
//   1 1 0:  64 bytes buffer for receiving (OUT endpoint) + 64 bytes buffer for transmittal (IN endpoint), total=128bytes
//   1 1 1:  dual 64 bytes buffer by bUEP_R_TOG selection for receiving (OUT endpoint) + dual 64 bytes buffer by bUEP_T_TOG selection for transmittal (IN endpoint), total=256bytes
#define 	RB_UEP4_RX_EN       0x08      // enable USB endpoint 4 receiving (OUT)
#define 	RB_UEP4_TX_EN       0x04      // enable USB endpoint 4 transmittal (IN)
// bUEP4_RX_EN & bUEP4_TX_EN: USB endpoint 4 buffer mode, buffer start address is UEP0_DMA
//   0 0:  single 64 bytes buffer for endpoint 0 receiving & transmittal (OUT & IN endpoint)
//   1 0:  single 64 bytes buffer for endpoint 0 receiving & transmittal (OUT & IN endpoint) + 64 bytes buffer for endpoint 4 receiving (OUT endpoint), total=128bytes
//   0 1:  single 64 bytes buffer for endpoint 0 receiving & transmittal (OUT & IN endpoint) + 64 bytes buffer for endpoint 4 transmittal (IN endpoint), total=128bytes
//   1 1:  single 64 bytes buffer for endpoint 0 receiving & transmittal (OUT & IN endpoint)
//           + 64 bytes buffer for endpoint 4 receiving (OUT endpoint) + 64 bytes buffer for endpoint 4 transmittal (IN endpoint), total=192bytes

#define	R8_UEP2_3_MOD		(*((PUINT8V)(0x4002340d)))	// endpoint 2/3 mode
#define 	RB_UEP3_RX_EN       0x80      // enable USB endpoint 3 receiving (OUT)
#define 	RB_UEP3_TX_EN       0x40      // enable USB endpoint 3 transmittal (IN)
#define 	RB_UEP3_BUF_MOD     0x10      // buffer mode of USB endpoint 3
#define 	RB_UEP2_RX_EN       0x08      // enable USB endpoint 2 receiving (OUT)
#define 	RB_UEP2_TX_EN       0x04      // enable USB endpoint 2 transmittal (IN)
#define 	RB_UEP2_BUF_MOD     0x01      // buffer mode of USB endpoint 2

#define	R8_UH_EP_MOD		R8_UEP2_3_MOD				//host endpoint mode
#define 	RB_UH_EP_TX_EN      0x40      // enable USB host OUT endpoint transmittal
#define 	RB_UH_EP_TBUF_MOD   0x10      // buffer mode of USB host OUT endpoint
// bUH_EP_TX_EN & bUH_EP_TBUF_MOD: USB host OUT endpoint buffer mode, buffer start address is UH_TX_DMA
//   0 x:  disable endpoint and disable buffer
//   1 0:  64 bytes buffer for transmittal (OUT endpoint)
//   1 1:  dual 64 bytes buffer by toggle bit bUH_T_TOG selection for transmittal (OUT endpoint), total=128bytes
#define 	RB_UH_EP_RX_EN      0x08      // enable USB host IN endpoint receiving
#define 	RB_UH_EP_RBUF_MOD   0x01      // buffer mode of USB host IN endpoint
// bUH_EP_RX_EN & bUH_EP_RBUF_MOD: USB host IN endpoint buffer mode, buffer start address is UH_RX_DMA
//   0 x:  disable endpoint and disable buffer
//   1 0:  64 bytes buffer for receiving (IN endpoint)
//   1 1:  dual 64 bytes buffer by toggle bit bUH_R_TOG selection for receiving (IN endpoint), total=128bytes

#define	R16_UEP0_DMA		(*((PUINT16V)(0x40023410)))	// endpoint 0 DMA buffer address
#define	R16_UEP1_DMA		(*((PUINT16V)(0x40023414)))	// endpoint 1 DMA buffer address
#define	R16_UEP2_DMA		(*((PUINT16V)(0x40023418)))	// endpoint 2 DMA buffer address
#define	R16_UH_RX_DMA		R16_UEP2_DMA				// host rx endpoint buffer high address
#define	R16_UEP3_DMA		(*((PUINT16V)(0x4002341c)))	// endpoint 3 DMA buffer address
#define	R16_UH_TX_DMA		R16_UEP3_DMA				// host tx endpoint buffer high address
#define	R32_USB_EP0_CTRL	(*((PUINT32V)(0x40023420)))	// endpoint 0 control & transmittal length
#define	R8_UEP0_T_LEN		(*((PUINT8V)(0x40023420)))	// endpoint 0 transmittal length
#define	R8_UEP0_CTRL		(*((PUINT8V)(0x40023422)))	// endpoint 0 control
#define	R32_USB_EP1_CTRL	(*((PUINT32V)(0x40023424)))	// endpoint 1 control & transmittal length
#define	R8_UEP1_T_LEN		(*((PUINT8V)(0x40023424)))	// endpoint 1 transmittal length
#define	R8_UEP1_CTRL		(*((PUINT8V)(0x40023426)))	// endpoint 1 control
#define 	RB_UEP_R_TOG        0x80      // expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1
#define 	RB_UEP_T_TOG        0x40      // prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1
#define 	RB_UEP_AUTO_TOG     0x10      // enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle
#define 	RB_UEP_R_RES1       0x08      // handshake response type high bit for USB endpoint X receiving (OUT)
#define 	RB_UEP_R_RES0       0x04      // handshake response type low bit for USB endpoint X receiving (OUT)
#define     MASK_UEP_R_RES    	0x0C      // bit mask of handshake response type for USB endpoint X receiving (OUT)
#define     UEP_R_RES_ACK     	0x00
#define     UEP_R_RES_TOUT    	0x04
#define     UEP_R_RES_NAK     	0x08
#define     UEP_R_RES_STALL   	0x0C
// RB_UEP_R_RES1 & RB_UEP_R_RES0: handshake response type for USB endpoint X receiving (OUT)
//   00: ACK (ready)
//   01: no response, time out to host, for non-zero endpoint isochronous transactions
//   10: NAK (busy)
//   11: STALL (error)
#define 	RB_UEP_T_RES1       0x02      // handshake response type high bit for USB endpoint X transmittal (IN)
#define 	RB_UEP_T_RES0       0x01      // handshake response type low bit for USB endpoint X transmittal (IN)
#define 	MASK_UEP_T_RES    	0x03      // bit mask of handshake response type for USB endpoint X transmittal (IN)
#define 	UEP_T_RES_ACK     	0x00
#define 	UEP_T_RES_TOUT    	0x01
#define 	UEP_T_RES_NAK     	0x02
#define 	UEP_T_RES_STALL   	0x03
// bUEP_T_RES1 & bUEP_T_RES0: handshake response type for USB endpoint X transmittal (IN)
//   00: DATA0 or DATA1 then expecting ACK (ready)
//   01: DATA0 or DATA1 then expecting no response, time out from host, for non-zero endpoint isochronous transactions
//   10: NAK (busy)
//   11: STALL (error)

